app/views/tweets/_form.html.erb

SELECT `tags`.* FROM `tags`
---
      <p>
        <%= f.collection_check_boxes(:tag_ids, Tag.all, :id, :name) do |tag| %>