app/views/tweets/index.html.erb

      <%= form_tag tweets_path, method: :get, class: 'boards__searchForm' do %>
       <%= select_tag :tag_id,
                 options_from_collection_for_select(Tag.all, :id, :name, params[:tag_id]),
                 {
---
SELECT `tags`.* FROM `tags`

       <span>年代:</span>
       <% tweet.tags.each do |tag| %>
---
SELECT `tags`.* FROM `tags` INNER JOIN `tweet_tags` ON `tags`.`id` = `tweet_tags`.`tag_id` WHERE `tweet_tags`.`tweet_id` = 9

      <% if tweet.favorited_by?(current_user) %> <!-- ログインしているユーザーがファボしたかどうかで分岐 -->
        <p><span>◯: </span><%=link_to tweet.favorites.count, tweet_favorites_path(tweet.id), method: :delete %></p>
---
SELECT COUNT(*) FROM `favorites` WHERE `favorites`.`tweet_id` = 4

      <% if tweet.gooded_by?(current_user) %> <!-- ログインしているユーザーがファボしたかどうかで分岐 -->
        <p><span>△: </span><%=link_to tweet.goods.count, tweet_goods_path(tweet.id), method: :delete %></p>
---
SELECT COUNT(*) FROM `goods` WHERE `goods`.`tweet_id` = 9

      <% if tweet.baded_by?(current_user) %> <!-- ログインしているユーザーがファボしたかどうかで分岐 -->
        <p><span>✕: </span><%=link_to tweet.bads.count, tweet_bads_path(tweet.id), method: :delete %></p>
---
SELECT COUNT(*) FROM `bads` WHERE `bads`.`tweet_id` = 9