app/views/tweets/show.html.erb

SELECT `tags`.* FROM `tags` INNER JOIN `tweet_tags` ON `tags`.`id` = `tweet_tags`.`tag_id` WHERE `tweet_tags`.`tweet_id` = 6
---
  <span>年代:</span>
  <% @tweet.tags.each do |tag| %>

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1
---
    <div>
      <%= c.user.name unless c.user.blank? %>