app/views/users/show.html.erb

       <span>年代:</span>
       <% tweet.tags.each do |tag| %>
---
SELECT `tags`.* FROM `tags` INNER JOIN `tweet_tags` ON `tags`.`id` = `tweet_tags`.`tag_id` WHERE `tweet_tags`.`tweet_id` = 5

     <span>年代:</span>
     <% tweet.tags.each do |tag| %>
---
SELECT `tags`.* FROM `tags` INNER JOIN `tweet_tags` ON `tags`.`id` = `tweet_tags`.`tag_id` WHERE `tweet_tags`.`tweet_id` = 6