app/controllers/bads_controller.rb

INSERT INTO `bads` (`user_id`, `tweet_id`, `created_at`, `updated_at`) VALUES (1, 8, '2020-06-07 16:20:56.900599', '2020-06-07 16:20:56.900599')
SELECT `goods`.* FROM `goods` WHERE `goods`.`user_id` = 1 AND `goods`.`tweet_id` = 8 LIMIT 1
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 1 AND `favorites`.`tweet_id` = 8 LIMIT 1
DELETE FROM `favorites` WHERE `favorites`.`id` = 7
---
  def create
    bad = current_user.bads.build(tweet_id: params[:tweet_id])
    bad.save
    redirect_to tweets_path

    if @good= Good.find_by(user_id: current_user.id, tweet_id: params[:tweet_id])
      @good.destroy
    end
    if @favorite= Favorite.find_by(user_id: current_user.id, tweet_id: params[:tweet_id])
      @favorite.destroy