app/controllers/favorites_controller.rb

  def create
    # こう記述することで、「current_userに関連したFavoriteクラスの新しいインスタンス」が作成可能。
    # つまり、favorite.user_id = current_user.idが済んだ状態で生成されている。
    # buildはnewと同じ意味で、アソシエーションしながらインスタンスをnewする時に形式的に使われる。
    favorite = current_user.favorites.build(tweet_id: params[:tweet_id])
    favorite.save
    redirect_to tweets_path


    if @good= Good.find_by(user_id: current_user.id, tweet_id: params[:tweet_id])
      @good.destroy
    end
    if @bad= Bad.find_by(user_id: current_user.id, tweet_id: params[:tweet_id])
---
INSERT INTO `favorites` (`user_id`, `tweet_id`, `created_at`, `updated_at`) VALUES (1, 1, '2020-05-11 20:13:33.502966', '2020-05-11 20:13:33.502966')
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`tweet_id` = 1 AND `favorites`.`user_id` = 1 LIMIT 1
SELECT `goods`.* FROM `goods` WHERE `goods`.`user_id` = 1 AND `goods`.`tweet_id` = 8 LIMIT 1
DELETE FROM `goods` WHERE `goods`.`id` = 1
SELECT `bads`.* FROM `bads` WHERE `bads`.`user_id` = 1 AND `bads`.`tweet_id` = 8 LIMIT 1

  def destroy
    favorite = Favorite.find_by(tweet_id: params[:tweet_id], user_id: current_user.id)
    favorite.destroy
---
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`tweet_id` = 1 AND `favorites`.`user_id` = 1 LIMIT 1
DELETE FROM `favorites` WHERE `favorites`.`id` = 1