app/controllers/goods_controller.rb

  def create
    good = current_user.goods.build(tweet_id: params[:tweet_id])
    good.save
    redirect_to tweets_path

    if @bad= Bad.find_by(user_id: current_user.id, tweet_id: params[:tweet_id])
      @bad.destroy
    end
    if @favorite= Favorite.find_by(user_id: current_user.id, tweet_id: params[:tweet_id])
      @favorite.destroy
---
INSERT INTO `goods` (`user_id`, `tweet_id`, `created_at`, `updated_at`) VALUES (1, 8, '2020-06-07 16:21:10.856975', '2020-06-07 16:21:10.856975')
SELECT `bads`.* FROM `bads` WHERE `bads`.`user_id` = 1 AND `bads`.`tweet_id` = 8 LIMIT 1
DELETE FROM `bads` WHERE `bads`.`id` = 1
SELECT `favorites`.* FROM `favorites` WHERE `favorites`.`user_id` = 1 AND `favorites`.`tweet_id` = 8 LIMIT 1
DELETE FROM `favorites` WHERE `favorites`.`id` = 8