app/controllers/tweets_controller.rb

SELECT `tweets`.* FROM `tweets` ORDER BY `tweets`.`created_at` DESC
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
SELECT `tags`.* FROM `tags` WHERE `tags`.`id` = 1 LIMIT 1
---
  def index
    @tweets = Tweet.all
    @q = Tweet.ransack(params[:q])
    @tweets = params[:tag_id].present? ? Tag.find(params[:tag_id]).tweets : Tweet.all

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 4 ORDER BY `tweets`.`created_at` DESC LIMIT 1
---
  def show
    @tweet = Tweet.find(params[:id])

INSERT INTO `tweets` (`body`, `user_id`, `created_at`, `updated_at`, `country`, `image`) VALUES ('フレンチワークジャケットで、ポケットがV字ステッチのものは、30～40年代といえる。', 3, '2020-06-06 09:25:16.363959', '2020-06-06 09:25:16.363959', 'フランス', 'フレンチワーク.jpg')
---
  def create
    @tweet = Tweet.new(tweet_params)  # フォームから送られてきたデータ(body)をストロングパラメータを経由して@tweetに代入
    @tweet.user_id = current_user.id # user_idの情報はフォームからはきていないので、deviseのメソッドを使って「ログインしている自分のid」を代入
    @tweet.save

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 6 ORDER BY `tweets`.`created_at` DESC LIMIT 1
UPDATE `tweets` SET `tweets`.`body` = '軍服にカーキ色を採用したのは、イギリス軍が最初であると言われている。カーキは砂埃という意味で、白い軍服に泥を塗ってカモフラージュしたのが始まりである。', `tweets`.`image` = 'aa6ff4c579094c2887b77c667e096645.jpg', `tweets`.`updated_at` = '2020-05-31 15:09:42.835881' WHERE `tweets`.`id` = 5
---
  def update
    @tweet = Tweet.find(params[:id])
    if @tweet.update(tweet_params)

DELETE FROM `tweets` WHERE `tweets`.`id` = 7
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 7 ORDER BY `tweets`.`created_at` DESC LIMIT 1
---
  def destroy
    Tweet.find(params[:id]).destroy